<template>
    <view class="px-5 text-sm">
        <view class="text-center mb-5">
            <view class=" text-2xl font-bold">隐私政策</view>
            <view>日期：2020-11-10</view>
        </view>
        <view class="my-2">
            膳见纤玺
            <text class="font-bold">【华瑞（贵安新区）航天医学配方食品有限公司】</text>
            致力于成为企业公民的典范，竭力为创造一个美丽世界做出贡献。我们高度重视诚信和透明度，
            致力于与顾客在互信互利的基础上建立稳固持久的关系。
        </view>
        <view class="my-2">
            本隐私政策设置了我们向您收集、或您向我们提供的将由我们处理的任何个人信息基本内容。
            请仔细阅读下文以便了解我们对您个人信息的观点、做法和我们如何处理这些信息的。
        </view>
        <view class="my-2">
            通过使用当前平台（如下文定义），您接受并同意我们按本隐私政策中描述的做法。
        </view>
        <view class="my-2 text-pink-100">
            本政策将帮助您了解以下内容：
            <view class="pl-2 -mt-2">
                <text>\n1.本隐私政策如何适用；</text>
                <text>\n2.我们会收集您的什么个人信息；</text>
                <text>\n3.我们如何使用您的个人信息；</text>
                <text>\n4.我们如何使用Cookie和同类技术；</text>
                <text>\n5.我们会分享或披露您的个人信息吗；</text>
                <text>\n6.您的信息储存安全吗；</text>
                <text>\n7.我们如何保护未成年人的隐私；</text>
                <text>\n8.我们隐私政策的修订；</text>
                <text>\n9.如何联系我们关于隐私问题。</text>
            </view>
        </view>
        <view class="my-2 font-bold text-pink-100">本隐私政策如何适用？</view>
        <view>
            本隐私政策适用于所有网站，应用程序，在线游戏/抽奖活动，以及其他在线或者线下过程
            中个人信息被处理的活动（“平台”）。本隐私政策不适用于第三方网站，包括那些我们平台
            可能提及的或通过链接可能访问的网站。
        </view>
        <view class="my-2 font-bold text-pink-100">我们会收集您的什么个人信息？</view>
        <view class="my-2">
            当您使用我们平台的时候，我们可能收集和处理您通过填写表格、线上内容上传、订阅在
            线服务（如：应用程序和社交网络页面）或者写信给我们的方式向我们提供的个人信息，比
            如：
        </view>
        <view class="my-2">
            姓名、电子邮件地址、性别、电话号码、通讯地址、年龄/出生日期、您对我们产品的意见、
            付费细节（电子商务平台）、您的购买历史（电子商务平台）、与我们联系时的任何特殊要求
            （主要为存档目的）以及您乐意分享的照片、音频或视频。
        </view>
        <view class="my-2">
            我们可能请您完成我们用于研究和统计目的的调查。
        </view>
        <view class="my-2">
            我们可能为完成或提高产品和服务质量而从第三方获得您授权共享的上述个人信息。我们平
            台中的服务可能使您能够为他人订购产品或服务。使用我们平台的其他用户也可能分享您的
            信息，包括个人信息，特别是在使用专为用户间信息分享而设计的服务时。除非信息权利主
            体提出相反的主张，该信息将如同您的个人信息依据本隐私政策处理。因此，请您谨慎考虑
            上述他人信息的分享。向我们主动分享前述信息的时候，我们视为您已经获得上述分享的授权。
        </view>

        <view class="my-2 font-bold text-pink-100">我们如何使用您的个人信息？</view>

        <view class="my-2">
            我们仅会出于以下所述目的，收集和使用您的个人信息：
        </view>
        <view class="my-2">
            我们使用您的个人信息主要是为了管理客户/关系前景，特别是回复您的请求或给您定期发
            送有关我们产品、我们品牌、我们倡议和/或我们平台可能引起您兴趣的新闻和资讯。
        </view>

        <view class="my-2">我们还会使用您的个人信息来提升您在我们平台上的数字体验，即了解您感兴趣的平台内容，
            根据您的指令管理您的网上账户，验证您参与我们活动的注册信息，处理您的付款，确保我
            们的平台为您提供最高效的服务，以及保障您免遭潜在的欺诈交易。
        </view>

        <view class="my-2">当我们打算将您的个人信息用于上述未载明的其他用途，或者将基于特定目的收集而来的信
            息用于其他目的时，我们会事先征求您的同意。
        </view>

        <view class="my-2 font-bold text-pink-100">我们如何使用Cookie和同类技术？</view>

        <view class="my-2">为系统管理和/或数据统计的目的我们会收集您的IP地址和您的浏览器类型而没有任何识别
            个人信息的行为。
        </view>

        <view class="my-2">在某些情况下，我们会使用Cookies，它们是当您访问我们的平台时下载并储存到您设备上
            的字符和数字组成的小型文件。在您再次连接到我们的平台时识别您并为您匹配符合您兴趣
            的内容。
        </view>

        <view class="my-2">网页浏览器的默认设置通常被设为接收Cookies，但是您可以通过修改浏览器设置而轻易更
            改。但是，请注意如果您选择关闭接收Cookies，那么您可能无法访问平台的部分内容。
        </view>

        <view class="my-2 font-bold text-pink-100">我们会分享或披露您的个人信息吗？</view>

        <view class="my-2">我们也可能将您的个人信息分享给可信赖的第三方。我们需要可信第三方代表我们履行一些
            业务。
        </view>

        <view class="my-2">我们仅向他们提供其履行业务所必需的信息，并我们要求他们不能将您的信息用于其他目的。
            我们会尽力督促我们合作的第三方对您的个人信息采取安全措施。
        </view>

        <view class="my-2 font-bold text-pink-100">我们可能分享您的个人信息给：</view>

        <view class="my-2">广告、营销、数字和社交媒体机构，以帮助我们提供广告、营销和宣传，分析它们的有效性，
            以及来管理您的联系方式和问题；
            按要求为您运送产品的第三方，如邮递/快递服务；
            分析和搜索引擎供应商，以帮助我们改进和优化我们平台；以及
            我们可能会在以下情况披露您的个人信息给第三方：
        </view>

        <view class="my-2">如果我们出售或购买任何业务或资产，我们可能向潜在的卖家或买家披露您的个人信息；
            如果我们或某部分我们的资产被第三方收购，您的个人信息可能作为其拥有的客户有关的资
            产，而成为被转移资产的一部分；
            如果我们因为遵循法律义务而有义务披露或分享您的个人信息，或者我们为了执行或应用我
            们的使用条款和其他协议，或为了保护我们的权利、财产或我们的安全，或者我们客户或者
            他人的安全。这包括为反欺诈保护而与其他公司和机构交换您的个人信息；以及
            在获取您同意的其他情形，或在法律法规允许时。
        </view>

        <view class="my-2 font-bold text-pink-100">我们将您的个人信息存储在何处？</view>

        <view class="my-2">您的个人信息会储存在我们或者我们服务供应商的数据库中。
            我们在中华人民共和国境内收集和产生的个人信息，将存储在中华人民共和国境内。
        </view>

        <view class="my-2 font-bold text-pink-100">您的信息储存安全吗？</view>

        <view class="my-2"> 为了始终以最可靠最安全的方式存储您的个人信息，我们仅在必要的时候对其进行处理。出
            于这种考虑，我们会采用适当的安保、技术及组织措施防止任何更改您的信息或是让您的信
            息丢失的行为，亦或是未经授权的访问。
        </view>

        <view class="my-2 font-bold text-pink-100">我们如何保护未成年人的隐私？</view>

        <view class="my-2">如您未成年，我们建议您请您的父母或监护人仔细阅读本隐私政策。在征得他们同意的前提
            下，您可使用我们的服务或向我们提供信息。如果没有父母或监护人的同意，未成年人不得
            创建自己的用户账户。
        </view>

        <view class="my-2">如果我们发现在未事先获得可证实的父母或法定监护人同意的情况下，我们收集了未成年人
            的信息，我们将删除该等信息。
        </view>

        <view class="my-2 font-bold text-pink-100">我们隐私政策的修订
        </view>
        <view>请留意我们可能偶尔对本隐私政策进行修改。这种情况下，修改将刊登在本页。</view>

        <view class="my-2 font-bold text-pink-100">如何联系我们关于隐私问题</view>

        <view class="my-2">
            如您对本隐私政策内容有任何疑问、意见或建议，想要改变您授权我们收集、使用个人信息
            的范围，或终止您的授权，您可以通过发送邮件至
            <text class="font-bold">shanjianqianxi@huadongbio.com</text>
            与我
            们客户服务中心联系。
        </view>
    </view>
</template>

<script lang="ts">
import {Component, Vue} from 'vue-property-decorator'

@Component({})
export default class Privacy extends Vue {
}
</script>

<style scoped>

</style>